
/* File generated by gen_cfile.py. Should not be modified. */

#ifndef TESTSLAVE_H
#define TESTSLAVE_H

#include "data.h"

typedef struct
{
	UNS32 year;
	UNS32 month;
	UNS16 day;
	UNS16 week;
	UNS8 hour;
	UNS32 minute;
	UNS8 second;
	UNS16 ms;
	UNS16 us;
}Time;
typedef struct
{
	UNS8 apple;
	UNS32 orange;
	UNS8 pear;
	UNS8 water;
	UNS32 milk;
	UNS16 coffee;
	UNS32 rice;
	UNS8 mango;
	UNS8 nut;
	UNS8 peanut;
	UNS32 sea;	
	UNS8 cookie;
	UNS16 cabbage;
}Cost;
extern int Timelength;
extern int Costlength;
/* Prototypes of function provided by object dictionnary */
UNS32 TestSlave_valueRangeTest (UNS8 typeValue, void * value);
//const OD_OI_TypeDef * TestSlave_scanIndexOD (UNS16 wIndex, UNS32 * errorCode, ODCallback_t **callbacks);
UNS32 Call_Null(CO_Data* d, const OD_OI_typeDef * d12, UNS8 bSubindex);
/* Master node data struct */
extern CO_Data TestSlave_Data;
//extern ODCallback_t Store_parameters_callbacks[];		/* Callbacks of index0x1010 */
//extern ODCallback_t Restore_Default_Parameters_callbacks[];		/* Callbacks of index0x1011 */
//extern ODCallback_t Transmit_PDO_1_Parameter_callbacks[];		/* Callbacks of index0x1800 */
//extern ODCallback_t Transmit_PDO_2_Parameter_callbacks[];		/* Callbacks of index0x1801 */
//extern ODCallback_t Transmit_PDO_3_Parameter_callbacks[];		/* Callbacks of index0x1802 */
//extern ODCallback_t Transmit_PDO_4_Parameter_callbacks[];		/* Callbacks of index0x1803 */
//extern ODCallback_t Transmit_PDO_5_Parameter_callbacks[];		/* Callbacks of index0x1804 */
extern UNS32 SlaveMap1;		/* Mapped at index 0x2000, subindex 0x00*/
extern UNS32 SlaveMap2;		/* Mapped at index 0x2001, subindex 0x00*/
extern UNS8 SlaveMap3;		/* Mapped at index 0x2002, subindex 0x00*/
extern UNS8 SlaveMap4;		/* Mapped at index 0x2003, subindex 0x00*/
extern UNS8 SlaveMap5;		/* Mapped at index 0x2004, subindex 0x00*/
extern UNS8 SlaveMap6;		/* Mapped at index 0x2005, subindex 0x00*/
extern UNS8 SlaveMap7;		/* Mapped at index 0x2006, subindex 0x00*/
extern UNS8 SlaveMap8;		/* Mapped at index 0x2007, subindex 0x00*/
extern UNS8 SlaveMap9;		/* Mapped at index 0x2008, subindex 0x00*/
extern UNS8 SlaveMap10;		/* Mapped at index 0x2009, subindex 0x00*/
extern UNS16 SlaveMap11;		/* Mapped at index 0x200A, subindex 0x00*/
extern INTEGER16 SlaveMap12;		/* Mapped at index 0x200B, subindex 0x00*/
extern INTEGER16 SlaveMap13;		/* Mapped at index 0x200C, subindex 0x00*/

extern UNS32 RPDO1DATA1;
extern UNS32 RPDO1DATA2;

extern UNS32 RPDO2DATA1;
extern UNS32 RPDO2DATA2;
extern UNS32 RPDO2DATA3;
extern UNS32 RPDO2DATA4;
extern UNS32 RPDO2DATA5;
extern UNS32 RPDO2DATA6;
extern UNS32 RPDO2DATA7;
extern UNS32 RPDO2DATA8;

extern UNS32 TPDO1DATA1;
extern UNS32 TPDO1DATA2;

extern UNS32 TPDO2DATA1;
extern UNS32 TPDO2DATA2;
extern UNS32 TPDO2DATA3;
extern UNS32 TPDO2DATA4;
extern UNS32 TPDO2DATA5;
extern UNS32 TPDO2DATA6;
extern UNS32 TPDO2DATA7;
extern UNS32 TPDO2DATA8;

extern int32_t unprofile_position;//200A

extern OD_OI_TypeDef TestSlave_objdict[];
//extern int objnum;
extern volatile int32_t  profile_target_position;//607A
extern volatile UNS32  profile_acceleration;//6083
extern volatile UNS32  profile_deceleration;//6084
extern UNS32  quick_stop_deceleration;//6085
extern UNS16  motion_profile_type;//6086
extern volatile UNS32  profile_velocity;//6081
extern UNS32  end_velocity;//6082
extern INTEGER32  target_velocity;//60FF
extern volatile uint16_t controlword;//6040
extern volatile uint16_t statusword;//6041

extern int joint_angle_int;//2008
extern int key_Encoder;//2009

extern int32_t min_position_range_limit;//607B01
extern int32_t max_position_range_limit;//607B02
extern int32_t min_position_limit;//607D01
extern int32_t max_position_limit;//607D02
extern UNS32  max_profile_velocity;//607F

extern INTEGER32  velocity_sensor_actual_value;//6069
extern INTEGER16  sensor_selection_code;//606A
extern INTEGER32  velocity_actual_value;//606C


extern INTEGER16 target_torque;//6071
extern INTEGER16  max_torque;//6072
extern INTEGER16  max_current;//6073
extern INTEGER16  torque_demand_value;//6074
extern UNS32  motor_rate_current;//6075
extern UNS32  motor_rate_torque;//6076
extern INTEGER16  torque_actual_value;//6077
extern INTEGER32  current_actual_value;//6078
extern UNS32  torque_slope;//6087
extern INTEGER16  torque_profile_type;//6088



/*******************charrise add data*******************/
extern INTEGER32 TestSlave_obj6067[];

//////////////////////////////////////////
/* added new data*/
extern UNS32  motor_current_param[];
extern UNS16  clear_fault;
extern UNS16  led_status;
extern UNS16  buzzer_status;
extern UNS16  ADC_status;
extern UNS16  jointboard_status;
extern UNS16  toggle_switch_status;
extern UNS32  abs_encoder_raw_data;
extern UNS16  stop_motion;


#endif // TESTSLAVE_H
